#include <iostream>
using namespace std;
float A1, A2, B1, B2, C1, C2, A, B, C;
int main(){
    //послідовне введення коефіцієнтів при змінних системи рівнянь
    cout << "Enter A1: \n";
    cin >> A1;
    cout << "Enter B1: \n";
    cin >> B1;
    cout << "Enter C1: \n";
    cin >> C1;
    cout << "Enter A2: \n";
    cin >> A2;
    cout << "Enter B2: \n";
    cin >> B2;
    cout << "Enter C2: \n";
    cin >> C2;
    //для простоти розуміння введемо буферні змінні для порівння коефіцієнтів
    A = A1/A2;
    B = B1/B2;
    C = C1/C2;
    if (A != B) //умова, коли рівняння має лише один розв'язок
        cout << "Система має лише один розв'язок\n";
    else
    {
        if (A != C)//умова, коли рівняння не має розв'язків або має безліч розв'язків
            cout << "Система не має розв'язків\n";
        
        else cout << "Система має безліч розв'язків\n";
    }
}
